build_config:
  input_shape:
  - null
  - 100
class_name: Sequential
config:
  build_input_shape:
  - null
  - 100
  dtype:
    class_name: DTypePolicy
    config:
      name: float32
    module: keras
    registered_name: null
  layers:
  - class_name: InputLayer
    config:
      batch_shape:
      - null
      - 100
      dtype: float32
      name: input_layer_1
      ragged: false
      sparse: false
    module: keras.layers
    registered_name: null
  - build_config:
      input_shape:
      - null
      - 100
    class_name: Dense
    config:
      activation: relu
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
        module: keras.initializers
        registered_name: null
      bias_regularizer: null
      dtype:
        class_name: DTypePolicy
        config:
          name: float32
        module: keras
        registered_name: null
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
        module: keras.initializers
        registered_name: null
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 64
      use_bias: true
    module: keras.layers
    registered_name: null
  - build_config:
      input_shape:
      - null
      - 64
    class_name: Dense
    config:
      activation: softmax
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
        module: keras.initializers
        registered_name: null
      bias_regularizer: null
      dtype:
        class_name: DTypePolicy
        config:
          name: float32
        module: keras
        registered_name: null
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
        module: keras.initializers
        registered_name: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 10
      use_bias: true
    module: keras.layers
    registered_name: null
  name: sequential
  trainable: true
module: keras
registered_name: null
